; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	image0 - mode
	spectrograph1 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Star6 - direction
	Star7 - direction
	GroundStation10 - direction
	Star8 - direction
	Star9 - direction
	Star4 - direction
	Star5 - direction
	GroundStation0 - direction
	Star11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star8)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument1 spectrograph1)
	(supports instrument1 image0)
	(calibration_target instrument1 Star9)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 GroundStation0)
	(supports instrument3 image0)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 Star4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
)
(:goal (and
	(have_image Star11 image0)
	(have_image Phenomenon12 image0)
	(have_image Star13 image0)
	(have_image Phenomenon14 image0)
	(have_image Planet15 spectrograph1)
	(have_image Planet16 spectrograph1)
))

)

; plan
1. (turn_to satellite1 star9 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star9)
   goals met: 0 of 6
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 6
3. (calibrate satellite1 instrument1 star9)
   added: (calibrated instrument1)
   goals met: 0 of 6
4. (turn_to satellite1 phenomenon14 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 phenomenon14)
   goals met: 0 of 6
5. (take_image satellite1 phenomenon14 instrument1 image0)
   added: (have_image phenomenon14 image0)
   goals met: 1 of 6
6. (turn_to satellite1 phenomenon12 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 phenomenon12)
   goals met: 1 of 6
7. (take_image satellite1 phenomenon12 instrument1 image0)
   added: (have_image phenomenon12 image0)
   goals met: 2 of 6
8. (turn_to satellite1 planet15 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 planet15)
   goals met: 2 of 6
9. (take_image satellite1 planet15 instrument1 spectrograph1)
   added: (have_image planet15 spectrograph1)
   goals met: 3 of 6
10. (turn_to satellite1 planet16 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 planet16)
   goals met: 3 of 6
11. (take_image satellite1 planet16 instrument1 spectrograph1)
   added: (have_image planet16 spectrograph1)
   goals met: 4 of 6
12. (turn_to satellite1 star11 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 star11)
   goals met: 4 of 6
13. (take_image satellite1 star11 instrument1 image0)
   added: (have_image star11 image0)
   goals met: 5 of 6
14. (turn_to satellite1 star13 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star13)
   goals met: 5 of 6
15. (take_image satellite1 star13 instrument1 image0)
   added: (have_image star13 image0)
   goals met: 6 of 6
